keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPort_reg.h
/**
 * \file IfxPort_reg.h
 * \brief
 * \copyright Copyright (c) 2012 Infineon Technologies AG. All rights reserved.
 *
 *
 * $Revision: 1586 $
 * $Date: 2013-09-03 14:43:49 +0200 (Di, 03 Sep 2013) $
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxLld_Port_Cfg Port address
 * \ingroup IfxLld_Port
 * 
 * \defgroup IfxLld_Port_Cfg_BaseAddress Base address
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P00 2-P00
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P01 2-P01
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P02 2-P02
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P10 2-P10
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P11 2-P11
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P12 2-P12
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P13 2-P13
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P14 2-P14
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P15 2-P15
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P20 2-P20
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P21 2-P21
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P22 2-P22
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P23 2-P23
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P24 2-P24
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P25 2-P25
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P26 2-P26
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P30 2-P30
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P31 2-P31
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P32 2-P32
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P33 2-P33
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P34 2-P34
 * \ingroup IfxLld_Port_Cfg
 * 
 * \defgroup IfxLld_Port_Cfg_P40 2-P40
 * \ingroup IfxLld_Port_Cfg
 * 
 */
#ifndef IFXPORT_REG_H
#define IFXPORT_REG_H
/******************************************************************************/
#include "IfxPort_regdef.h"
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_BaseAddress
 * \{  */

/** \\brief  Port object */
#define MODULE_P00 /*lint --e(923)*/ ((*(Ifx_P*)0xF003A000u))

/** \\brief  Port object */
#define MODULE_P01 /*lint --e(923)*/ ((*(Ifx_P*)0xF003A100u))

/** \\brief  Port object */
#define MODULE_P02 /*lint --e(923)*/ ((*(Ifx_P*)0xF003A200u))

/** \\brief  Port object */
#define MODULE_P10 /*lint --e(923)*/ ((*(Ifx_P*)0xF003B000u))

/** \\brief  Port object */
#define MODULE_P11 /*lint --e(923)*/ ((*(Ifx_P*)0xF003B100u))

/** \\brief  Port object */
#define MODULE_P12 /*lint --e(923)*/ ((*(Ifx_P*)0xF003B200u))

/** \\brief  Port object */
#define MODULE_P13 /*lint --e(923)*/ ((*(Ifx_P*)0xF003B300u))

/** \\brief  Port object */
#define MODULE_P14 /*lint --e(923)*/ ((*(Ifx_P*)0xF003B400u))

/** \\brief  Port object */
#define MODULE_P15 /*lint --e(923)*/ ((*(Ifx_P*)0xF003B500u))

/** \\brief  Port object */
#define MODULE_P20 /*lint --e(923)*/ ((*(Ifx_P*)0xF003C000u))

/** \\brief  Port object */
#define MODULE_P21 /*lint --e(923)*/ ((*(Ifx_P*)0xF003C100u))

/** \\brief  Port object */
#define MODULE_P22 /*lint --e(923)*/ ((*(Ifx_P*)0xF003C200u))

/** \\brief  Port object */
#define MODULE_P23 /*lint --e(923)*/ ((*(Ifx_P*)0xF003C300u))

/** \\brief  Port object */
#define MODULE_P24 /*lint --e(923)*/ ((*(Ifx_P*)0xF003C400u))

/** \\brief  Port object */
#define MODULE_P25 /*lint --e(923)*/ ((*(Ifx_P*)0xF003C500u))

/** \\brief  Port object */
#define MODULE_P26 /*lint --e(923)*/ ((*(Ifx_P*)0xF003C600u))

/** \\brief  Port object */
#define MODULE_P30 /*lint --e(923)*/ ((*(Ifx_P*)0xF003D000u))

/** \\brief  Port object */
#define MODULE_P31 /*lint --e(923)*/ ((*(Ifx_P*)0xF003D100u))

/** \\brief  Port object */
#define MODULE_P32 /*lint --e(923)*/ ((*(Ifx_P*)0xF003D200u))

/** \\brief  Port object */
#define MODULE_P33 /*lint --e(923)*/ ((*(Ifx_P*)0xF003D300u))

/** \\brief  Port object */
#define MODULE_P34 /*lint --e(923)*/ ((*(Ifx_P*)0xF003D400u))

/** \\brief  Port object */
#define MODULE_P40 /*lint --e(923)*/ ((*(Ifx_P*)0xF003E000u))
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P00
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P00_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003A0FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P00_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003A0F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P00_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003A050u)

/** \\brief  8, Identification Register */
#define P00_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003A008u)

/** \\brief  24, Port Input Register */
#define P00_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003A024u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P00_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003A010u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P00_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003A01Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P00_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003A014u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P00_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003A018u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P00_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003A0A0u)

