keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPort_reg.h
/** \\brief  64, Port Pin Controller Select Register */
#define P01_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003A164u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P01_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003A160u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P01_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003A140u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P01_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003A144u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P02
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P02_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003A2FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P02_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003A2F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P02_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003A250u)

/** \\brief  8, Identification Register */
#define P02_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003A208u)

/** \\brief  24, Port Input Register */
#define P02_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003A224u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P02_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003A210u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P02_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003A21Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P02_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003A214u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P02_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003A218u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P02_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003A2A0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P02_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003A2A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P02_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003A2A8u)

/** \\brief  AC, Port LVDS Pad Control Register 3 */
#define P02_LPCR3 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR3*)0xF003A2ACu)

/** \\brief  94, Port Output Modification Clear Register */
#define P02_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003A294u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P02_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003A280u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P02_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003A28Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P02_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003A284u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P02_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003A288u)

/** \\brief  4, Port Output Modification Register */
#define P02_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003A204u)

/** \\brief  90, Port Output Modification Set Register */
#define P02_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003A290u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P02_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003A270u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P02_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003A27Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P02_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003A274u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P02_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003A278u)

/** \\brief  0, Port Output Register */
#define P02_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003A200u)

/** \\brief  64, Port Pin Controller Select Register */
#define P02_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003A264u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P02_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003A260u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P02_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003A240u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P02_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003A244u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P10
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P10_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003B0FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P10_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003B0F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P10_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003B050u)

/** \\brief  8, Identification Register */
#define P10_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003B008u)

/** \\brief  24, Port Input Register */
#define P10_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003B024u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P10_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003B010u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P10_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003B01Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P10_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003B014u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P10_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003B018u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P10_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003B0A0u)

