keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPort_reg.h
/** \\brief  64, Port Pin Controller Select Register */
#define P11_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003B164u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P11_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003B160u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P11_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003B140u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P11_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003B144u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P12
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P12_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003B2FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P12_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003B2F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P12_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003B250u)

/** \\brief  8, Identification Register */
#define P12_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003B208u)

/** \\brief  24, Port Input Register */
#define P12_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003B224u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P12_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003B210u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P12_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003B21Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P12_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003B214u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P12_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003B218u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P12_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003B2A0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P12_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003B2A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P12_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003B2A8u)

/** \\brief  AC, Port LVDS Pad Control Register 3 */
#define P12_LPCR3 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR3*)0xF003B2ACu)

/** \\brief  94, Port Output Modification Clear Register */
#define P12_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003B294u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P12_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003B280u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P12_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003B28Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P12_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003B284u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P12_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003B288u)

/** \\brief  4, Port Output Modification Register */
#define P12_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003B204u)

/** \\brief  90, Port Output Modification Set Register */
#define P12_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003B290u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P12_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003B270u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P12_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003B27Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P12_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003B274u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P12_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003B278u)

/** \\brief  0, Port Output Register */
#define P12_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003B200u)

/** \\brief  64, Port Pin Controller Select Register */
#define P12_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003B264u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P12_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003B260u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P12_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003B240u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P12_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003B244u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P13
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P13_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003B3FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P13_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003B3F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P13_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003B350u)

/** \\brief  8, Identification Register */
#define P13_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003B308u)

/** \\brief  24, Port Input Register */
#define P13_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003B324u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P13_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003B310u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P13_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003B31Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P13_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003B314u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P13_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003B318u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P13_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003B3A0u)

