keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPort_reg.h
/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P13_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003B3A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P13_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003B3A8u)

/** \\brief  AC, Port LVDS Pad Control Register 3 */
#define P13_LPCR3 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR3*)0xF003B3ACu)

/** \\brief  94, Port Output Modification Clear Register */
#define P13_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003B394u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P13_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003B380u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P13_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003B38Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P13_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003B384u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P13_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003B388u)

/** \\brief  4, Port Output Modification Register */
#define P13_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003B304u)

/** \\brief  90, Port Output Modification Set Register */
#define P13_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003B390u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P13_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003B370u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P13_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003B37Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P13_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003B374u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P13_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003B378u)

/** \\brief  0, Port Output Register */
#define P13_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003B300u)

/** \\brief  64, Port Pin Controller Select Register */
#define P13_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003B364u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P13_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003B360u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P13_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003B340u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P13_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003B344u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P14
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P14_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003B4FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P14_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003B4F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P14_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003B450u)

/** \\brief  8, Identification Register */
#define P14_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003B408u)

/** \\brief  24, Port Input Register */
#define P14_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003B424u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P14_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003B410u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P14_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003B41Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P14_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003B414u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P14_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003B418u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P14_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003B4A0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P14_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003B4A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P14_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003B4A8u)

/** \\brief  AC, Port LVDS Pad Control Register 3 */
#define P14_LPCR3 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR3*)0xF003B4ACu)

/** \\brief  94, Port Output Modification Clear Register */
#define P14_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003B494u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P14_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003B480u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P14_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003B48Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P14_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003B484u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P14_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003B488u)

/** \\brief  4, Port Output Modification Register */
#define P14_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003B404u)

/** \\brief  90, Port Output Modification Set Register */
#define P14_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003B490u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P14_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003B470u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P14_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003B47Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P14_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003B474u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P14_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003B478u)

/** \\brief  0, Port Output Register */
#define P14_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003B400u)

