keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPort_reg.h
/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P20_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003C0A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P20_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003C0A8u)

/** \\brief  AC, Port LVDS Pad Control Register 3 */
#define P20_LPCR3 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR3*)0xF003C0ACu)

/** \\brief  94, Port Output Modification Clear Register */
#define P20_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003C094u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P20_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003C080u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P20_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003C08Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P20_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003C084u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P20_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003C088u)

/** \\brief  4, Port Output Modification Register */
#define P20_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003C004u)

/** \\brief  90, Port Output Modification Set Register */
#define P20_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003C090u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P20_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003C070u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P20_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003C07Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P20_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003C074u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P20_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003C078u)

/** \\brief  0, Port Output Register */
#define P20_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003C000u)

/** \\brief  64, Port Pin Controller Select Register */
#define P20_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003C064u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P20_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003C060u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P20_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003C040u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P20_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003C044u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P21
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P21_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003C1FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P21_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003C1F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P21_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003C150u)

/** \\brief  8, Identification Register */
#define P21_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003C108u)

/** \\brief  24, Port Input Register */
#define P21_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003C124u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P21_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003C110u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P21_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003C11Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P21_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003C114u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P21_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003C118u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P21_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003C1A0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P21_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003C1A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P21_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003C1A8u)

/** \\brief  AC, Port LVDS Pad Control Register 3 */
#define P21_LPCR3 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR3*)0xF003C1ACu)

/** \\brief  94, Port Output Modification Clear Register */
#define P21_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003C194u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P21_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003C180u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P21_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003C18Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P21_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003C184u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P21_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003C188u)

/** \\brief  4, Port Output Modification Register */
#define P21_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003C104u)

/** \\brief  90, Port Output Modification Set Register */
#define P21_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003C190u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P21_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003C170u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P21_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003C17Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P21_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003C174u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P21_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003C178u)

/** \\brief  0, Port Output Register */
#define P21_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003C100u)

