keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPort_reg.h
/** \\brief  64, Port Pin Controller Select Register */
#define P21_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003C164u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P21_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003C160u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P21_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003C140u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P21_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003C144u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P22
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P22_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003C2FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P22_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003C2F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P22_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003C250u)

/** \\brief  8, Identification Register */
#define P22_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003C208u)

/** \\brief  24, Port Input Register */
#define P22_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003C224u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P22_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003C210u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P22_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003C21Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P22_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003C214u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P22_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003C218u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P22_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003C2A0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P22_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003C2A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P22_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003C2A8u)

/** \\brief  AC, Port LVDS Pad Control Register 3 */
#define P22_LPCR3 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR3*)0xF003C2ACu)

/** \\brief  94, Port Output Modification Clear Register */
#define P22_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003C294u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P22_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003C280u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P22_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003C28Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P22_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003C284u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P22_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003C288u)

/** \\brief  4, Port Output Modification Register */
#define P22_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003C204u)

/** \\brief  90, Port Output Modification Set Register */
#define P22_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003C290u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P22_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003C270u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P22_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003C27Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P22_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003C274u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P22_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003C278u)

/** \\brief  0, Port Output Register */
#define P22_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003C200u)

/** \\brief  64, Port Pin Controller Select Register */
#define P22_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003C264u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P22_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003C260u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P22_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003C240u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P22_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003C244u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P23
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P23_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003C3FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P23_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003C3F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P23_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003C350u)

/** \\brief  8, Identification Register */
#define P23_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003C308u)

/** \\brief  24, Port Input Register */
#define P23_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003C324u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P23_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003C310u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P23_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003C31Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P23_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003C314u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P23_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003C318u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P23_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003C3A0u)

