keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPort_reg.h
/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P23_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003C3A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P23_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003C3A8u)

/** \\brief  AC, Port LVDS Pad Control Register 3 */
#define P23_LPCR3 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR3*)0xF003C3ACu)

/** \\brief  94, Port Output Modification Clear Register */
#define P23_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003C394u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P23_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003C380u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P23_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003C38Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P23_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003C384u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P23_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003C388u)

/** \\brief  4, Port Output Modification Register */
#define P23_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003C304u)

/** \\brief  90, Port Output Modification Set Register */
#define P23_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003C390u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P23_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003C370u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P23_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003C37Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P23_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003C374u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P23_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003C378u)

/** \\brief  0, Port Output Register */
#define P23_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003C300u)

/** \\brief  64, Port Pin Controller Select Register */
#define P23_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003C364u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P23_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003C360u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P23_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003C340u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P23_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003C344u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P24
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P24_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003C4FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P24_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003C4F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P24_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003C450u)

/** \\brief  8, Identification Register */
#define P24_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003C408u)

/** \\brief  24, Port Input Register */
#define P24_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003C424u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P24_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003C410u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P24_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003C41Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P24_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003C414u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P24_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003C418u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P24_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003C4A0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P24_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003C4A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P24_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003C4A8u)

/** \\brief  AC, Port LVDS Pad Control Register 3 */
#define P24_LPCR3 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR3*)0xF003C4ACu)

/** \\brief  94, Port Output Modification Clear Register */
#define P24_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003C494u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P24_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003C480u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P24_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003C48Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P24_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003C484u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P24_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003C488u)

/** \\brief  4, Port Output Modification Register */
#define P24_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003C404u)

/** \\brief  90, Port Output Modification Set Register */
#define P24_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003C490u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P24_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003C470u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P24_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003C47Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P24_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003C474u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P24_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003C478u)

/** \\brief  0, Port Output Register */
#define P24_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003C400u)

