keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPort_reg.h
/** \\brief  64, Port Pin Controller Select Register */
#define P24_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003C464u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P24_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003C460u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P24_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003C440u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P24_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003C444u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P25
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P25_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003C5FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P25_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003C5F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P25_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003C550u)

/** \\brief  8, Identification Register */
#define P25_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003C508u)

/** \\brief  24, Port Input Register */
#define P25_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003C524u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P25_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003C510u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P25_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003C51Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P25_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003C514u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P25_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003C518u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P25_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003C5A0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P25_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003C5A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P25_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003C5A8u)

/** \\brief  AC, Port LVDS Pad Control Register 3 */
#define P25_LPCR3 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR3*)0xF003C5ACu)

/** \\brief  94, Port Output Modification Clear Register */
#define P25_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003C594u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P25_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003C580u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P25_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003C58Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P25_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003C584u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P25_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003C588u)

/** \\brief  4, Port Output Modification Register */
#define P25_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003C504u)

/** \\brief  90, Port Output Modification Set Register */
#define P25_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003C590u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P25_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003C570u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P25_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003C57Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P25_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003C574u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P25_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003C578u)

/** \\brief  0, Port Output Register */
#define P25_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003C500u)

/** \\brief  64, Port Pin Controller Select Register */
#define P25_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003C564u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P25_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003C560u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P25_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003C540u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P25_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003C544u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P26
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P26_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003C6FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P26_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003C6F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P26_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003C650u)

/** \\brief  8, Identification Register */
#define P26_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003C608u)

/** \\brief  24, Port Input Register */
#define P26_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003C624u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P26_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003C610u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P26_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003C61Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P26_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003C614u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P26_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003C618u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P26_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003C6A0u)

