keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPort_reg.h
/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P26_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003C6A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P26_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003C6A8u)

/** \\brief  AC, Port LVDS Pad Control Register 3 */
#define P26_LPCR3 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR3*)0xF003C6ACu)

/** \\brief  94, Port Output Modification Clear Register */
#define P26_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003C694u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P26_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003C680u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P26_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003C68Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P26_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003C684u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P26_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003C688u)

/** \\brief  4, Port Output Modification Register */
#define P26_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003C604u)

/** \\brief  90, Port Output Modification Set Register */
#define P26_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003C690u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P26_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003C670u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P26_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003C67Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P26_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003C674u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P26_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003C678u)

/** \\brief  0, Port Output Register */
#define P26_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003C600u)

/** \\brief  64, Port Pin Controller Select Register */
#define P26_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003C664u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P26_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003C660u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P26_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003C640u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P26_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003C644u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P30
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P30_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003D0FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P30_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003D0F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P30_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003D050u)

/** \\brief  8, Identification Register */
#define P30_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003D008u)

/** \\brief  24, Port Input Register */
#define P30_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003D024u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P30_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003D010u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P30_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003D01Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P30_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003D014u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P30_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003D018u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P30_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003D0A0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P30_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003D0A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P30_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003D0A8u)

/** \\brief  AC, Port LVDS Pad Control Register 3 */
#define P30_LPCR3 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR3*)0xF003D0ACu)

/** \\brief  94, Port Output Modification Clear Register */
#define P30_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003D094u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P30_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003D080u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P30_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003D08Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P30_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003D084u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P30_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003D088u)

/** \\brief  4, Port Output Modification Register */
#define P30_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003D004u)

/** \\brief  90, Port Output Modification Set Register */
#define P30_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003D090u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P30_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003D070u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P30_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003D07Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P30_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003D074u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P30_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003D078u)

/** \\brief  0, Port Output Register */
#define P30_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003D000u)

