keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPort_reg.h
/** \\brief  64, Port Pin Controller Select Register */
#define P30_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003D064u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P30_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003D060u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P30_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003D040u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P30_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003D044u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P31
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P31_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003D1FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P31_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003D1F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P31_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003D150u)

/** \\brief  8, Identification Register */
#define P31_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003D108u)

/** \\brief  24, Port Input Register */
#define P31_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003D124u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P31_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003D110u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P31_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003D11Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P31_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003D114u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P31_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003D118u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P31_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003D1A0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P31_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003D1A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P31_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003D1A8u)

/** \\brief  AC, Port LVDS Pad Control Register 3 */
#define P31_LPCR3 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR3*)0xF003D1ACu)

/** \\brief  94, Port Output Modification Clear Register */
#define P31_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003D194u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P31_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003D180u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P31_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003D18Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P31_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003D184u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P31_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003D188u)

/** \\brief  4, Port Output Modification Register */
#define P31_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003D104u)

/** \\brief  90, Port Output Modification Set Register */
#define P31_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003D190u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P31_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003D170u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P31_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003D17Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P31_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003D174u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P31_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003D178u)

/** \\brief  0, Port Output Register */
#define P31_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003D100u)

/** \\brief  64, Port Pin Controller Select Register */
#define P31_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003D164u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P31_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003D160u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P31_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003D140u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P31_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003D144u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P32
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P32_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003D2FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P32_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003D2F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P32_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003D250u)

/** \\brief  8, Identification Register */
#define P32_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003D208u)

/** \\brief  24, Port Input Register */
#define P32_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003D224u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P32_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003D210u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P32_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003D21Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P32_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003D214u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P32_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003D218u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P32_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003D2A0u)

