keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPort_reg.h
/** \\brief  64, Port Pin Controller Select Register */
#define P33_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003D364u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P33_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003D360u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P33_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003D340u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P33_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003D344u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P34
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P34_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003D4FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P34_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003D4F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P34_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003D450u)

/** \\brief  8, Identification Register */
#define P34_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003D408u)

/** \\brief  24, Port Input Register */
#define P34_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003D424u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P34_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003D410u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P34_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003D41Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P34_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003D414u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P34_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003D418u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P34_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003D4A0u)

/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P34_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003D4A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P34_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003D4A8u)

/** \\brief  AC, Port LVDS Pad Control Register 3 */
#define P34_LPCR3 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR3*)0xF003D4ACu)

/** \\brief  94, Port Output Modification Clear Register */
#define P34_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003D494u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P34_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003D480u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P34_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003D48Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P34_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003D484u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P34_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003D488u)

/** \\brief  4, Port Output Modification Register */
#define P34_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003D404u)

/** \\brief  90, Port Output Modification Set Register */
#define P34_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003D490u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P34_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003D470u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P34_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003D47Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P34_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003D474u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P34_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003D478u)

/** \\brief  0, Port Output Register */
#define P34_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003D400u)

/** \\brief  64, Port Pin Controller Select Register */
#define P34_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003D464u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P34_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003D460u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P34_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003D440u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P34_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003D444u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Port_Cfg_P40
 * \{  */

/** \\brief  FC, Port Access Enable Register 0 */
#define P40_ACCEN0 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN0*)0xF003E0FCu)

/** \\brief  F8, Port Access Enable Register 1 */
#define P40_ACCEN1 /*lint --e(923)*/ (*(volatile Ifx_P_ACCEN1*)0xF003E0F8u)

/** \\brief  50, Port Emergency Stop Register */
#define P40_ESR /*lint --e(923)*/ (*(volatile Ifx_P_ESR*)0xF003E050u)

/** \\brief  8, Identification Register */
#define P40_ID /*lint --e(923)*/ (*(volatile Ifx_P_ID*)0xF003E008u)

/** \\brief  24, Port Input Register */
#define P40_IN /*lint --e(923)*/ (*(volatile Ifx_P_IN*)0xF003E024u)

/** \\brief  10, Port Input/Output Control Register 0 */
#define P40_IOCR0 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR0*)0xF003E010u)

/** \\brief  1C, Port Input/Output Control Register 12 */
#define P40_IOCR12 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR12*)0xF003E01Cu)

/** \\brief  14, Port Input/Output Control Register 4 */
#define P40_IOCR4 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR4*)0xF003E014u)

/** \\brief  18, Port Input/Output Control Register 8 */
#define P40_IOCR8 /*lint --e(923)*/ (*(volatile Ifx_P_IOCR8*)0xF003E018u)

/** \\brief  A0, Port LVDS Pad Control Register 0 */
#define P40_LPCR0 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR0*)0xF003E0A0u)

