keeper999/EngineControl_Aurix/01_Get_Src/BSW/VD56_BSW/VD56_GEN_BSW/MCAL_TC29X_DRV_P1/Drv/IfxPort_reg.h
/** \\brief  A4, Port LVDS Pad Control Register 1 */
#define P40_LPCR1 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR1*)0xF003E0A4u)

/** \\brief  A8, Port LVDS Pad Control Register 2 */
#define P40_LPCR2 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR2*)0xF003E0A8u)

/** \\brief  AC, Port LVDS Pad Control Register 3 */
#define P40_LPCR3 /*lint --e(923)*/ (*(volatile Ifx_P_LPCR3*)0xF003E0ACu)

/** \\brief  94, Port Output Modification Clear Register */
#define P40_OMCR /*lint --e(923)*/ (*(volatile Ifx_P_OMCR*)0xF003E094u)

/** \\brief  80, Port Output Modification Clear Register 0 */
#define P40_OMCR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR0*)0xF003E080u)

/** \\brief  8C, Port Output Modification Clear Register 12 */
#define P40_OMCR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR12*)0xF003E08Cu)

/** \\brief  84, Port Output Modification Clear Register 4 */
#define P40_OMCR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR4*)0xF003E084u)

/** \\brief  88, Port Output Modification Clear Register 8 */
#define P40_OMCR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMCR8*)0xF003E088u)

/** \\brief  4, Port Output Modification Register */
#define P40_OMR /*lint --e(923)*/ (*(volatile Ifx_P_OMR*)0xF003E004u)

/** \\brief  90, Port Output Modification Set Register */
#define P40_OMSR /*lint --e(923)*/ (*(volatile Ifx_P_OMSR*)0xF003E090u)

/** \\brief  70, Port Output Modification Set Register 0 */
#define P40_OMSR0 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR0*)0xF003E070u)

/** \\brief  7C, Port Output Modification Set Register 8 */
#define P40_OMSR12 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR12*)0xF003E07Cu)

/** \\brief  74, Port Output Modification Set Register 4 */
#define P40_OMSR4 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR4*)0xF003E074u)

/** \\brief  78, Port Output Modification Set Register 8 */
#define P40_OMSR8 /*lint --e(923)*/ (*(volatile Ifx_P_OMSR8*)0xF003E078u)

/** \\brief  0, Port Output Register */
#define P40_OUT /*lint --e(923)*/ (*(volatile Ifx_P_OUT*)0xF003E000u)

/** \\brief  64, Port Pin Controller Select Register */
#define P40_PCSR /*lint --e(923)*/ (*(volatile Ifx_P_PCSR*)0xF003E064u)

/** \\brief  60, Port Pin Function Decision Control Register */
#define P40_PDISC /*lint --e(923)*/ (*(volatile Ifx_P_PDISC*)0xF003E060u)

/** \\brief  40, Port Pad Driver Mode 0 Register */
#define P40_PDR0 /*lint --e(923)*/ (*(volatile Ifx_P_PDR0*)0xF003E040u)

/** \\brief  44, Port Pad Driver Mode 1 Register */
#define P40_PDR1 /*lint --e(923)*/ (*(volatile Ifx_P_PDR1*)0xF003E044u)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXPORT_REG_H */
